---
kind: method
id: M:Autodesk.Revit.DB.CurveLoop.Dispose
source: html/77bad211-6dcf-cb86-c66f-ac25384ccd31.htm
---
# Autodesk.Revit.DB.CurveLoop.Dispose Method

Releases all resources used by the CurveLoop

## Syntax (C#)
```csharp
public void Dispose()
```